import {useState, useEffect} from 'react';
// Хук useEffect называется с двумя аргументами с двумя параметрами                

const Users = () => {
//  бул жерде келген данныйларды сактайт
    const [users,setUsers] = useState([]);
// синтасиси useEffect(()=>{...},[зависимости]),  
// биринчи колбек функция алат, кийин функция аткарылат рирендер болсо(состояние озгорсо),
// если биз пустой массив кылып жазып койсок ,биздин жазган код бир эле жолу иштейт
// жана рирендер болуп кетпейт
// состоение канча жолу озгорсо дагы функция бир эле жолу иштейт.
//  биз жазып койгон пустой массивтин жардамы менен
// эч кандай массив жазбай койсок функциябыз иштей берет озгоргон сайын. компонентабыз канча жолу загрузка болсо useEffect токтобостон иштей берет
useEffect(()=>{
     fetch('https://jsonplaceholder.typicode.com/users')
     //биз запрос жоноттук
    .then((result)=> {
        return result.json();
    })
    // запросту бизге алып келди
    .then((data)=> setUsers(data));

},[])//SetUstateти коргондо после обновление,  квадратный скопканын жардамы менен ДОМ очуп кайра куйсо дагы кайрадан загрузка болсо дагы бир эле жолу иштейт.
// но биз пустой массивтин ичине бир нерсе(мисалы:данный) жазган болсок биз жазган нерсега(данный озгоргонго жараша) карап запрос иштеп турат.


return (
    <ul>
        {/* келген данныйларды маптын жардамы менен итерациядан откорот */}
        {users.map((user)=>(
          <li key ={user.id}>{user.name}</li>
        ))}
          </ul>
  );
};

export default Users

